app/views/currencies/index.html.erb

SELECT "countries".* FROM "countries"
SELECT COUNT(*) FROM "countries_users" WHERE "countries_users"."user_id" = 'user@example.com'
---
        <th>Collected</th>
        <td><%= CountriesUser.count_of_visited_countries(current_user) %></td>