app/views/countries/index.html.erb

SELECT "countries".* FROM "countries"
SELECT COUNT(*) FROM "countries" WHERE "countries"."visited" = 't'
SELECT COUNT(*) FROM "countries_users" WHERE (user_id= 'user3@mail.com' AND country_code=NULL)
---
<% puts "#"*80 %>
<%  puts "count of visited= #{CountriesUser.count_of_visited_countries(current_user)}"%>