app/views/countries/show.html.erb

SELECT "currencies".* FROM "currencies" WHERE "currencies"."country_id" = 'af'
---
  <ul>
    <% @country.currencies.each do |currency| %>