app/controllers/countries_controller.rb

  def update
    @country = Country.find(params[:id])

    respond_to do |format|
      if @country.update_attributes(params[:country])&&CountriesUser.update_status(current_user,params[:id])
---
UPDATE "countries" SET "visited" = 't', "updated_at" = '2014-11-05 09:40:56.933957' WHERE "countries"."code" = 'af'