app/controllers/countries_users_controller.rb

INSERT INTO "countries_users" ("country_code", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["country_code", ["am", "aw"]], ["created_at", Fri, 07 Nov 2014 14:37:10 UTC +00:00], ["updated_at", Fri, 07 Nov 2014 14:37:10 UTC +00:00], ["user_id", "user3@mail.com"]]
---
    def create
        user=params[:countries_user][:user]
        countries=params[:country]
        if !countries.nil?
            countries.each do|elm|
                  if !CountriesUser.visited?(current_user,elm) # проверка на существование данной записи в базе
                    CountriesUser.new(:user_id=>current_user.email,:country_code=>elm).save  #если её ещё нет, то сохраняем