app/controllers/currencies_controller.rb

SELECT "currencies".* FROM "currencies"
---
  def index
    @currencies = Currency.all

INSERT INTO "countries_users" ("country_code", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)
---
  def create
    currencies=params[:country]
    if !currencies.nil?
      currencies.each do |i|
        if !CountriesUser.visited?(current_user, i) # проверка на существование данной записи в базе
          CountriesUser.new(:user_id => current_user.email, :country_code => i).save # если нет, то сохраняем